In [2]:
import pandas as pd
import numpy as np

In [4]:
s=pd.Series([1,2,3,np.nan,np.nan,4])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [15]:
s.notnull().sum()     #total no of not null vale

np.int64(4)

In [6]:
s.notnull().count()

np.int64(6)

In [7]:
s[pd.notnull(s)]    #fetching only not null values

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [8]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [10]:
s.isna().count()

np.int64(6)

In [12]:
s[s.isnull()]   #fetching only null values

3   NaN
4   NaN
dtype: float64

In [13]:
#dropping null values
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [14]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [18]:
df=pd.DataFrame({
    'cola':[1,np.nan,30],
    'colb':[2,np.nan,32],
    'colc':[np.nan,np.nan,100]
})
df

   cola  colb   colc
0   1.0   2.0    NaN
1   NaN   NaN    NaN
2  30.0  32.0  100.0

In [19]:
df.dropna(how='all')

   cola  colb   colc
0   1.0   2.0    NaN
2  30.0  32.0  100.0

In [20]:
df.dropna()

   cola  colb   colc
2  30.0  32.0  100.0

In [30]:
df.dropna(thresh=3)

   cola  colb   colc
2  30.0  32.0  100.0

In [29]:
df.dropna(thresh=2,axis=0)

   cola  colb   colc
0   1.0   2.0    NaN
2  30.0  32.0  100.0

In [31]:
df.dropna(thresh=2,axis=1)

   cola  colb
0   1.0   2.0
1   NaN   NaN
2  30.0  32.0